IDEA StatiCa Open Model
SectionStiffnesses.GIx Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 torsion stiffness
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double GIx { get; set; }
Public Property GIx As Double
	Get
	Set
public:
property double GIx {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
SectionStiffnesses Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace